In [1]:
import pandas as pd
import numpy as np

#### drop()方法会返回一个轴向上删除指定值后的新对象

In [2]:
obj = pd.Series([1,2,3,4],index=['a','b','c','d'])

In [3]:
obj

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
obj.drop('b')

a    1
c    3
d    4
dtype: int64

In [5]:
obj.drop(['b','d'])

a    1
c    3
dtype: int64

In [6]:
obj

a    1
b    2
c    3
d    4
dtype: int64

#### DataFranme中，传递标签序列给到drop()方法时，会根据行标签删除值

In [7]:
df = pd.DataFrame(np.arange(12).reshape(4,3),index=['a','b','c','d'],columns=['XX','YY','ZZ'])
df

   XX  YY  ZZ
a   0   1   2
b   3   4   5
c   6   7   8
d   9  10  11

In [8]:
df.drop(['b','c'])

   XX  YY  ZZ
a   0   1   2
d   9  10  11

In [9]:
df.drop(index=['b','c'])

   XX  YY  ZZ
a   0   1   2
d   9  10  11

In [10]:
df.drop(['b','c'] , axis=0)

   XX  YY  ZZ
a   0   1   2
d   9  10  11

#### 使用 columns 关键字或通过axis=1('columns')的方式从列中删除值

In [11]:
df.drop(columns=['XX','YY'])

   ZZ
a   2
b   5
c   8
d  11

In [12]:
df.drop(['XX','ZZ'],axis=1)

   YY
a   1
b   4
c   7
d  10

In [13]:
df.drop(['YY','ZZ'],axis='columns')

   XX
a   0
b   3
c   6
d   9

#### drop()方法直接操作原对象而不返回新对象。使用 inplace=True 会覆盖原数据

In [14]:
# 原数据为变化
df

   XX  YY  ZZ
a   0   1   2
b   3   4   5
c   6   7   8
d   9  10  11

In [15]:
df.drop(['XX','ZZ'],axis=1,inplace=True)

In [16]:
df

   YY
a   1
b   4
c   7
d  10